<template>
  <section id="info" class="info">
    <div class="container">
      <!--
          <div class="row">
            <div class="col-12">
                <div class="alert alert-danger" role="alert">
                    Регистрация на Кибербиатлон
                    <sup>2018</sup> закрыта.
                    <a href="#result" class="alert-link smoothscroll">Посмотреть результаты</a>.
                </div>
            </div>
        </div>
      -->
      <div class="row">
        <div class="col-md-6">
          <h2>Формат</h2>
          <!--          <p>-->
          <!--            <strong>Кибербиатлон</strong> &mdash; это командные соревнования по-->
          <!--            защите информации.-->
          <!--          </p>-->
          <!--          <p>-->
          <!--            Мы приглашаем принять участие команды-->
          <!--            <strong>школьников из разных учебных заведений</strong>. В рамках-->
          <!--            соревнования командам будут предложены разнообразные задания по-->
          <!--            <strong-->
          <!--              >криптографии, стеганографии, уязвимости веб-приложений</strong-->
          <!--            >-->
          <!--            и другим аспектам компьютерной и информационной безопасности.-->
          <!--          </p>-->
          <!--          <p>-->
          <!--            Решением каждой из задач является-->
          <!--            <strong>флаг</strong>, который приносит команде то ли иное число-->
          <!--            очков, в зависимости от сложности задания.-->
          <!--          </p>-->
          <p>
            <b>Кибербиатлон 2020</b> — командные соревнования школьников по
            <b></b> защите информации. В рамках соревнования командам учащимся
            из разных учебных заведений предоставляются задания по криптографии,
            стеганографии, уязвимости веб-приложений и прочим аспектам
            компьютерной и <b>информационной безопасности</b>. ⠀
          </p>

          <p>
            Кибербиатлон 2020 прошел 18 и 19 апреля в онлайн формате.
            Организаторами соревнования была кафедра КБ-4 «Интеллектуальные
            системы информационной безопасности» ИКБСП. Техническую поддержку
            соревнованиям оказала компания Deteact. Также партнерами выступила
            компания «Лаборатория Касперского».
          </p>

          <p>
            Кибербиатлон 2020 проводится уже не первый год. За это время он стал
            для многих ребят хорошим стимулом, чтобы развиваться в сфере
            <b>IT-безопасности</b>.
          </p>
          Больше информации о соревнованиях в оффициальной группе
          <a class="text-primary" href="https://vk.com/biatlon_ikbsp"
            >ВКонтакте</a
          >
        </div>
        <div class="col-md-6">
          <h2>Регламент</h2>
          <ul class="fa-ul">
            <li>
              <span class="fa-li">
                <font-awesome-icon :icon="['fas', 'clock']" />
              </span>
              Продолжительность
              <strong>4 часа</strong>.
            </li>
            <li>
              <span class="fa-li">
                <font-awesome-icon :icon="['fas', 'school']" />
              </span>
              Задания ориентированы на
              <strong>школьников 9-11 классов</strong>.
            </li>
            <li>
              <span class="fa-li">
                <font-awesome-icon :icon="['fas', 'user-friends']" />
              </span>
              Количество человек в команде:
              <strong>4-7 человек</strong>.
            </li>
            <li>
              <span class="fa-li">
                <font-awesome-icon :icon="['fas', 'signature']" />
              </span>
              Обязательна
              <strong>предварительная регистрация</strong>.
            </li>
            <li>
              <span class="fa-li">
                <font-awesome-icon :icon="['fas', 'laptop']" />
              </span>
              На очных соревнованиях
              <strong>приветствуются собственные ноутбуки</strong>.
            </li>
            <li>
              <span class="fa-li">
                <font-awesome-icon :icon="['fas', 'exclamation']" />
              </span>
              На соревнованиях
              <b>запрещены деструктивные воздействия</b> на инфраструктуру
              соревнований и устройства других участников.
            </li>
          </ul>
        </div>
      </div>
      <div class="row my-4">
        <div class="col-12">
          <h2>О соревнованиях</h2>
          <p>
            В соревнованиях участвовало 49 команд. 30 командам удалось решить
            хотя бы одно задание. Задания были самыми <b>разнообразными</b> ,
            для их решения участники не только проявили смекалку, но и применили
            все свои знания об <b>информационной безопасности</b> на практике.
          </p>

          <p>
            Благодаря проведённым <b>онлайн мастер-классам</b>, команды
            порадовали нас быстрым и качественным решением многих тасков. На
            протяжении нескольких часов, все участники в
            <b>упорной борьбе</b> сражались за звание победителей Кибербиатлон
            <sup>2020</sup>.
          </p>
        </div>
      </div>
      <div class="row">
        <div class="col-md-6 align-self-center">
          <h2>Расписание</h2>
          <table class="table table-borderless schedule">
            <tbody>
              <tr>
                <td class="schedule__date">18 апреля 2020</td>
                <td colspan="2">Мастер классы и лекции по тематике ИБ</td>
              </tr>
              <!-- <tr>
                <td class="schedule__date">30 ноября 2018</td>
                <td colspan="2">За</td>
              </tr>-->
              <tr>
                <td class="schedule__date" rowspan="6">19 апреля 2020</td>
                <td>День соревнований</td>
              </tr>
              <tr>
                <td>10:00</td>
                <td>Начало соревнований</td>
              </tr>
              <tr>
                <td>15:00</td>
                <td>Окончание соревнований</td>
              </tr>
              <tr>
                <td>15:30</td>
                <td>Подведение итогов</td>
              </tr>
            </tbody>
          </table>
        </div>
        <div class="col-md-6">
          <h2>Призы</h2>
          <ul>
            <li>
              Все участники команд, которые смогли решить одну и более задач,
              получили <b>3 дополнительных балла</b> , а
              <b>победители и призёры</b> - 7 дополнительных баллов к результату
              ЕГЭ при поступлении в <b>РТУ МИРЭА!</b>
            </li>
            <li>
              <span class="fa-li">
                <i class="fas fa-level-up-alt"></i>
              </span>
              Непревзойденный опыт.
            </li>
            <li>
              <span class="fa-li">
                <i class="fas fa-smile"></i>
              </span>
              Хорошее настроение.
            </li>
          </ul>
          <p>
            Хотим поблагодарить <b>всех участников</b> за достойную игру и
            пожелать дальнейших <b>успехов и развития</b> в сфере информационной
            безопасности!
          </p>
        </div>
      </div>

      <div class="row">
        <div id="result" class="col-12">
          <h2 class="mb-4">Результаты</h2>
          <table class="table table-striped table-bordered results">
            <caption>
              Результаты соревнований
            </caption>
            <thead>
              <tr>
                <th scope="col-3">#</th>
                <th scope="col-3">Название команды</th>
                <th scope="col-6">Учебное заведение</th>
              </tr>
            </thead>
            <tbody>
              <tr v-for="(item, i) in results" :key="item" class="results__row">
                <td class="results__title" scope="row">{{ i + 1 }} место</td>
                <td>{{ item.name }}</td>
                <td>{{ item.about }}</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  data: () => ({
    results: [
      {
        name: 'Считаем манулов',
        about:
          'Сборная школ ГБОУ Школа №2007 ФМШ,  ГБОУ Многопрофильная Школа № 1537 «Информационные технологии», ГБОУ Школа №444, ГБОУ Многопрофильная школа № 1577 '
      },
      {
        name: 'Картинг по ру»',
        about:
          'Сборная школ  МБОУ "Лицей №136", СУНЦ НГУ, Инженерный лицей КНИТУ-КАИ, МБОУ "Инженерный лицей №83 имени Пинского М.С. УГНТУ", Томский физико-технический лицей'
      },
      {
        name: 'UnDefuse',
        about:
          'Команда Государственного бюджетного общеобразовательного учреждения города Москвы "Школа № 2086"'
      }
    ]
  })
}
</script>

<style lang="scss" scoped>
.info {
  .results {
    &__tropy {
      &--golden {
        color: #ffd700;
      }
      &--silver {
        color: #c0c0c0;
      }
      &--bronze {
        color: #cd7f32;
      }
    }
  }
}
</style>
